package collectionFramework;

// LinkedList
// 배열은 가장 기본적인 형태의 자료구조 : 간단한 구조, 데이터를 읽어들이는데 걸리는 시간이 빠르다.
// 하지만 크기를 변경할 수 없어 새로운 배열을 생성해서 데이터를 복사해야하는 단점과
// 실행속도를 향상시키기 위해서는 충분히 큰 크기의 배열을 생성해야 하므로 메모리가 낭비된다.
// 또한 차례대로 데이터를 추가하고 마지막에서부터 데이터를 삭제하는 것은 빠르지만
// 배열의 중간에 데이터를 추가하려면 빈자리를 만들기 위해 다른 데이터들을 복사해서 이동해야 한다.
// 이러한 단점을 보완하기 위해 LinkedList 고안 - 불연속적으로 존재하는 데이터를 서로 연결한 형태
// LinkedList 는 이동방향이 단방향이기 때문에 다음 요소에 접근은 쉽지만 이전 요소에 대한 접근은 어렵다.
// 이 점을 보완한 것이 Doubly LinkedList .
public class Ex09 {
	public static void main(String[] args) {
		
	}
}



































