package search;

// 트리와 이진트리
// * 트리의 기본 성질
// 트리는 노드와 노드들을 연결하는 링크로 구성
// 루트노드를 제외한 트리의 모든 노드들은 유일한 부모노드를 가진다.
// 부모가 동일한 노드들을 형제 관계라고 한다.
// 자식이 없는 노드들을 리프 노드라고 하며
// 리프노드가 아닌 노드들을 내부노드라고 한다.
// n 개의 노드가 있을 때 링크의 개수는 n-1 개 이다.
// * 이진트리
// 이진 트리에서 각 노드는 최대 2개의 자식을 가진다.
// 각각의 자식 노드는 자신이 부모의 왼쪽 자식인지 오른쪽 자식인지가 지정
// 이진 트리의 예 : 호프만 코드
// full and complete binary trees
// 높이가 h인 full binary tree 는 2^h - 1 개의 노드를 가진다.
// 노드가 n 개인 full 혹은 complete 이진트리의 높이는 O(logN)이다.
// 노드가 n 개인 이진트리의 높이는 최악의 경우 N이 될 수도 있다.
// 루트 노드의 주소는 따로 보관해야 한다.
// 이진 트리의 순회
// 순회 : 이진 트리의 모든 노드를 방문하는 일
// 중순위 순회, 선순위 순회, 후순위 순회, 레벨오더 순회
public class Ex01 {
	public static void main(String[] args) {
		
	}
}




















